mocleiri/tensorflow-micropython-examples/boards/esp32/MICROLITE_S2_SPIRAM/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ESP32S2 Microlite"
#define MICROPY_HW_MCU_NAME "ESP32-S2FN4R2"

#define MICROPY_PY_BLUETOOTH                (0)
#define MICROPY_HW_ENABLE_SDCARD            (0)

// these were from the um_tiny s2 double check if they match the ESP32S2DEVKITM1R
// #define MICROPY_HW_I2C0_SCL (9)
// #define MICROPY_HW_I2C0_SDA (8)

// #define MICROPY_HW_SPI1_MOSI (35)
// #define MICROPY_HW_SPI1_MISO (36)
// #define MICROPY_HW_SPI1_SCK (37)
